{
  "class_name": "Sequential",
  "config": {
    "name": "sequential",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            7
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "embedding_input"
        }
      },
      {
        "class_name": "Embedding",
        "config": {
          "name": "embedding",
          "trainable": true,
          "batch_input_shape": [
            null,
            7
          ],
          "dtype": "float32",
          "input_dim": 256,
          "output_dim": 100,
          "embeddings_initializer": {
            "class_name": "RandomUniform",
            "config": {
              "minval": -0.05,
              "maxval": 0.05,
              "seed": null
            }
          },
          "embeddings_regularizer": null,
          "activity_regularizer": null,
          "embeddings_constraint": null,
          "mask_zero": true,
          "input_length": 7
        }
      },
      {
        "class_name": "SpatialDropout1D",
        "config": {
          "name": "spatial_dropout1d",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "LSTM",
        "config": {
          "name": "lstm",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": true,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 200,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.3,
          "recurrent_dropout": 0.0,
          "implementation": 2
        }
      },
      {
        "class_name": "LSTM",
        "config": {
          "name": "lstm_1",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": false,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 100,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.3,
          "recurrent_dropout": 0.0,
          "implementation": 2
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": "float32",
          "units": 200,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": "float32",
          "units": 4,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      }
    ]
  },
  "keras_version": "2.8.0",
  "backend": "tensorflow"
}